snlkuharlocal/src/Catalogs/КлючиБезопасногоХранилищаДанных/КлючиБезопасногоХранилищаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлючиБезопасногоХранилищаДанных</name>
  <comment>// Ихсанов Д. А. 30.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2523</comment>
  <predefined>
    <items>
      <name>ДанныеDocFlowRabbitПлатежнаяИнформацияИсходящийПоток</name>
      <description>Данные doc flow rabbi платежная информация исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаВходящийПоток</name>
      <description>Данные doc flow rabbit банковские счета входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаВходящийПотокТест</name>
      <description>Данные doc flow rabbit банковские счета входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаИсходящийПоток</name>
      <description>Данные doc flow rabbit банковские счета исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitБанковскиеСчетаИсходящийПотокТест</name>
      <description>Данные doc flow rabbit банковские счета исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыВходящийПоток</name>
      <description>Данные doc flow rabbit договоры входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыВходящийПотокТест</name>
      <description>Данные doc flow rabbit договоры входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыИсходящийПоток</name>
      <description>Данные doc flow rabbit договоры исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitДоговорыИсходящийПотокТест</name>
      <description>Данные doc flow rabbit договоры исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОВходящийПоток</name>
      <description>Данные doc flow rabbit ЗНО входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОВходящийПотокТест</name>
      <description>Данные doc flow rabbit ЗНО входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОИсходящийПоток</name>
      <description>Данные doc flow rabbit ЗНО исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitЗНОИсходящийПотокТест</name>
      <description>Данные doc flow rabbit ЗНО исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыВходящийПоток</name>
      <description>Данные doc flow rabbit контрагенты входящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыВходящийПотокТест</name>
      <description>Данные doc flow rabbit контрагенты входящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыИсходящийПоток</name>
      <description>Данные doc flow rabbit контрагенты исходящий поток</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitКонтрагентыИсходящийПотокТест</name>
      <description>Данные doc flow rabbit контрагенты исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеDocFlowRabbitПлатежнаяИнформацияИсходящийПотокТест</name>
      <description>Данные doc flow rabbit платежная информация исходящий поток тест</description>
    </items>
    <items>
      <name>ДанныеHTTPПубликацииSNL</name>
      <description>Данные HTTP публикации SNL</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPCollant</name>
      <description>Данные авторизации к FTP collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPWatcom</name>
      <description>Данные авторизации к FTP Watcom</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPКлиента</name>
      <description>Данные авторизации к FTP клиента</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPКонтур</name>
      <description>Данные авторизации к FTP контур</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPНаСайтеCollant</name>
      <description>Данные авторизации к FTP на сайте collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКFTPСклада</name>
      <description>Данные авторизации к FTP Склада</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКHTTPОбмену</name>
      <description>Данные авторизации к http обмену</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКWebСервисуСклада</name>
      <description>Данные авторизации к web сервису склада</description>
    </items>
    <items>
      <name>ДанныеАвторизацииАрхивЛогов</name>
      <description>Данные авторизации к базе архива логов</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКЗУП_31</name>
      <description>Данные авторизации к ЗУП_31</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКЗУП_ЕЕ</name>
      <description>Данные авторизации к ЗУП_ЕЕ</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуХелпДеск</name>
      <description>Данные авторизации к почтовому серверу</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуRobot</name>
      <description>Данные авторизации к почтовому серверу robot</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуScud</name>
      <description>Данные авторизации к почтовому серверу scud</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКПочтовомуСерверуЕкод</name>
      <description>Данные авторизации к почтовому серверу Екод</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКСайтуCollant</name>
      <description>Данные авторизации к сайту Collant</description>
    </items>
    <items>
      <name>ДанныеАвторизацииКСайтуIdexgroup</name>
      <description>Данные авторизации к сайту idexgroup</description>
    </items>
    <items>
      <name>ДанныеАвторизацииОзонТокен</name>
      <description>Данные авторизации озон токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииРВБ_БТК_Токен</name>
      <description>Данные авторизации РВБ БТК токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииРВБ_ЕЕЭ_Токен</name>
      <description>Данные авторизации РВБ ЕЕЭ токен</description>
    </items>
    <items>
      <name>ДанныеАвторизацииФормированиеБланкаSecretKey</name>
      <description>Данные авторизации формирование бранка Secret Key</description>
    </items>
    <items>
      <name>ПутьКФайлуОповещенияОбОшибкеТСД_RDP</name>
      <description>Путь к файлу оповещения об ошибке ТСД RDP</description>
    </items>
    <items>
      <name>ХранилищеДанныхS3</name>
      <description>Хранилище данных s3</description>
    </items>
  </predefined>
  <tabularSections>
    <name>ИспользуемыеТипыКлючей</name>
    <attributes>
      <name>ТипКлюча</name>
      <type>
        <types>EnumRef.ТипыКлючейБезопасногоХранилищаДанных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/КлючиБезопасногоХранилищаДанных/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ) 
	
	//Тимофеев Ю.А. 20.01.2026
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
                
	Если ЭтоНовый() Тогда
		Отказ = Истина;
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаНаличиеДублейТиповКлючей(Отказ);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура - Проверить на наличие дублей типов ключей
//
// Параметры:
//  Отказ	 - Булево - Флаг разрешения на окончание записи элемента
//
Процедура ПроверитьНаНаличиеДублейТиповКлючей(Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.ТипКлюча КАК ТипКлюча,
	|	КОЛИЧЕСТВО(КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1.ТипКлюча) КАК ТипКлюча1
	|ИЗ
	|	Справочник.КлючиБезопасногоХранилищаДанных.ИспользуемыеТипыКлючей КАК КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиБезопасногоХранилищаДанных.ИспользуемыеТипыКлючей КАК КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1
	|		ПО КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.Ссылка = КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1.Ссылка
	|			И КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.ТипКлюча = КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1.ТипКлюча
	|ГДЕ
	|	КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей.ТипКлюча
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(КлючиБезопасногоХранилищаДанныхИспользуемыеТипыКлючей1.ТипКлюча) > 1");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		СообщитьИзМодуля("Обнаружены дубли типа ключа по элементу ключа безопасности данных");
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьНаНаличиеДублейТиповКлючей()

#КонецЕсли

#КонецОбласти
